TestOutputWsdl.xml

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions xmlns:wsa="http://schemas.xmlsoap.org/ws/2003/03/addressing" xmlns:tns="tns" xmlns:plink="http://schemas.xmlsoap.org/ws/2003/05/partner-link/" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:soap12env="http://www.w3.org/2003/05/soap-envelope/" xmlns:senc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:senv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap12enc="http://www.w3.org/2003/05/soap-encoding/" targetNamespace="tns" name="BgSoapService"><wsdl:types><xs:schema targetNamespace="tns" elementFormDefault="qualified"><xs:complexType name="stringArray"><xs:sequence><xs:element name="string" type="xs:string" minOccurs="0" maxOccurs="unbounded" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="bg"><xs:sequence><xs:element name="title" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="address" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="application" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="id" type="xs:integer" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="bgResponse"><xs:sequence><xs:element name="bgResult" type="tns:stringArray" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="stringArray" type="tns:stringArray"/><xs:element name="bg" type="tns:bg"/><xs:element name="bgResponse" type="tns:bgResponse"/></xs:schema></wsdl:types><wsdl:message name="bg"><wsdl:part name="bg" element="tns:bg"/></wsdl:message><wsdl:message name="bgResponse"><wsdl:part name="bgResponse" element="tns:bgResponse"/></wsdl:message><wsdl:service name="BgSoapService"><wsdl:port name="BgSoapService" binding="tns:BgSoapService"><soap:address location="http://localhost:5000/soap/bgservice/reflection"/></wsdl:port></wsdl:service><wsdl:portType name="BgSoapService"><wsdl:operation name="bg" parameterOrder="bg"><wsdl:input name="bg" message="tns:bg"/><wsdl:output name="bgResponse" message="tns:bgResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="BgSoapService" type="tns:BgSoapService"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="bg"><soap:operation soapAction="bg" style="document"/><wsdl:input name="bg"><soap:body use="literal"/></wsdl:input><wsdl:output name="bgResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding></wsdl:definitions>