output.txt

Bg test script
--------------
Inputed good xml
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="tns" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <ns0:Body>
      <ns1:bg>
         <ns1:title>TN0001</ns1:title>
         <ns1:address>8 Cornwall Street Plymouth PL6 7FD</ns1:address>
         <ns1:application>AP1</ns1:application>
         <ns1:id>3</ns1:id>
      </ns1:bg>
   </ns0:Body>
</SOAP-ENV:Envelope>
\nReturned result
<?xml version='1.0' encoding='UTF-8'?>
<senv:Envelope xmlns:tns="tns" xmlns:senv="http://schemas.xmlsoap.org/soap/envelope/"><senv:Body><tns:bgResponse><tns:bgResult><tns:string>TN0001</tns:string><tns:string>8 Cornwall Street Plymouth PL6 7FD</tns:string><tns:string>AP1</tns:string><tns:string>3</tns:string></tns:bgResult></tns:bgResponse></senv:Body></senv:Envelope>\nInputed bad xml
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="tns" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <ns0:Body>
      <ns1:bg>
         <ns1:title>TN0001</ns1:title>
         <ns1:address>8 Cornwall Street Plymouth PL6 7FD</ns1:address>
         <ns1:application>AP1</ns1:application>
         <ns1:id>THREE</ns1:id>
      </ns1:bg>
   </ns0:Body>
</SOAP-ENV:Envelope>

Returned result
<?xml version='1.0' encoding='UTF-8'?>
<senv:Envelope xmlns:senv="http://schemas.xmlsoap.org/soap/envelope/"><senv:Body><senv:Fault><faultcode>senv:Client.SchemaValidationError</faultcode><faultstring>:1:0:ERROR:SCHEMASV:SCHEMAV_CVC_DATATYPE_VALID_1_2_1: Element '{tns}id': 'THREE' is not a valid value of the atomic type 'xs:integer'.</faultstring><faultactor></faultactor></senv:Fault></senv:Body></senv:Envelope>